** set variables about lisp-mode to work with emacslisp
   #+BEGIN_SRC emacs-lisp
     (add-hook 'emacs-lisp-mode-hook #'turn-on-eldoc-mode)
     (add-hook 'emacs-lisp-mode-hook #'elisp-slime-nav-mode)
     (add-hook 'ielm-mode-hook #'elisp-slime-nav-mode)
     (add-hook 'ielm-mode-hook #'turn-on-eldoc-mode)
     (add-hook 'lisp-interaction-mode-hook #'turn-on-eldoc-mode)
     (add-hook 'lisp-mode-hook #'slime-lisp-mode-hook)

     (setq inferior-lisp-program "sbcl.exe --dynamic-space-size 1024")
   #+END_SRC

   #+RESULTS:
   : sbcl.exe --dynamic-space-size 1024

** paredit, eldoc, show-paren and electric return
   #+BEGIN_SRC emacs-lisp
     (add-hook 'emacs-lisp-mode-hook
	       (lambda ()
		 (paredit-mode t)
		 (turn-on-eldoc-mode)
		 (eldoc-add-command
		  'paredit-backward-delete
		  'paredit-close-round)
		 (local-set-key (kbd "RET") 'electrify-return-if-match)
		 (eldoc-add-command 'electrify-return-if-match)
		 (show-paren-mode t)))
   #+END_SRC

   #+RESULTS:
   | (lambda nil (paredit-mode t) (turn-on-eldoc-mode) (eldoc-add-command (quote paredit-backward-delete) (quote paredit-close-round)) (local-set-key (kbd RET) (quote electrify-return-if-match)) (eldoc-add-command (quote electrify-return-if-match)) (show-paren-mode t)) | elisp-slime-nav-mode | enable-paredit-mode | turn-on-eldoc-mode | ac-emacs-lisp-mode-setup |

